<a href="https://colab.research.google.com/github/ussalbt/datascience/blob/main/Q_28_01_datetime.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
from scipy import stats
import re

# to avoid warnings
import warnings
warnings.filterwarnings('ignore')
warnings.warn("this will not show")

## Question-3
Convert and merge json files into one Pandas.Dataframe

In [ ]:
Json1 = [{'name': 'JOHN', 
          'age': 27}, 
         {'name': 'HENRY2', 
          'age': 14}]

Json2 = {1:{'name': 'vikash', 
             'age': 27}, 
         2:{'name': 'Satyam', 
            'age': 14} }

data = [{'id': 1, 
         'name': "Cole Volk", 
         'fitness': {'height': 130, 'weight': 60}}, 
        {'name': "Mose Reg",
         'fitness': {'height': 130, 'weight': 60}}, 
        {'id': 2, 
         'name': 'Faye Raker', 
         'fitness': {'height': 130, 'weight':60}}]

In [ ]:
# Create df1 from Json1
df1=pd.DataFrame(Json1)
df1

# df1 = pd.json_normalize(Json1)
# df1

# df1 = pd.DataFrame.from_dict(Json1, orient = 'columns')
# df1

     name  age
0    JOHN   27
1  HENRY2   14

In [ ]:
# Create df2 from Json2
df2=pd.DataFrame(Json2).T
df2

# df2 = pd.DataFrame.from_dict(Json2, orient = 'columns').T
# df2

     name age
1  vikash  27
2  Satyam  14

In [ ]:
# Concatenate df1 and df2 data frame
df3 = pd.concat([df1, df2], sort=False, ignore_index = True)
df3

     name age
0    JOHN  27
1  HENRY2  14
2  vikash  27
3  Satyam  14

In [ ]:
# Create df dataframe from data
df=pd.DataFrame(data)
df

# df = pd.DataFrame.from_dict(data, orient = 'columns')
# df

# df = pd.json_normalize(data, max_level = 1)
# df

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mose Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [ ]:
# Create df4 Dataframe from df.fitness
df4=pd.DataFrame([i for i in df.fitness])
df4

   height  weight
0     130      60
1     130      60
2     130      60

In [ ]:
# Concatenate df and df4 data frame
df4 = pd.concat([df,df4],axis=1).drop('fitness',axis=1)
df4

    id        name  height  weight
0  1.0   Cole Volk     130      60
1  NaN    Mose Reg     130      60
2  2.0  Faye Raker     130      60

In [ ]:
df3.merge(df4, on='name', how='outer')

         name  age   id  height  weight
0        JOHN   27  NaN     NaN     NaN
1      HENRY2   14  NaN     NaN     NaN
2      vikash   27  NaN     NaN     NaN
3      Satyam   14  NaN     NaN     NaN
4   Cole Volk  NaN  1.0   130.0    60.0
5    Mose Reg  NaN  NaN   130.0    60.0
6  Faye Raker  NaN  2.0   130.0    60.0

## Question-4
How can we convert a Series to DataFrame?

In [ ]:
# Solution-1
s = pd.Series(["a", "b", "c"],    
name="vals")    
s.to_frame()

  vals
0    a
1    b
2    c

In [ ]:
# Solution-2
s = pd.Series(["a", "b", "c"],    
name="vals")    
pd.DataFrame(s)

  vals
0    a
1    b
2    c

## Question-5
How to convert String to date?

In [ ]:
from datetime import datetime    
    
# Define dates as the strings       
date_str1 = 'Wednesday, July 14, 2018'    
date_str2 = '14/7/17'    
date_str3 = '07-14-2017'    
    
# Define dates as the datetime objects    
dmy_dt1 = datetime.strptime(date_str1, '%A, %B %d, %Y')    
dmy_dt2 = datetime.strptime(date_str2, '%d/%m/%y')    
dmy_dt3 = datetime.strptime(date_str3, '%m-%d-%Y')    
    
#Print the converted dates    
print(dmy_dt1, dmy_dt2, dmy_dt3) 

type(dmy_dt1), type(dmy_dt2), type(dmy_dt3)

2018-07-14 00:00:00 2017-07-14 00:00:00 2017-07-14 00:00:00

(datetime.datetime, datetime.datetime, datetime.datetime)